{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Pietro Pezzullo",
    "label": "Fullstack & Web3 Developer",
    "image": "https://github.com/ppezzull.png",
    "summary": "Fullstack developer with hands-on experience in both Web3 and traditional Web2 environments. I’ve participated in multiple blockchain hackathons, including ETHRome and ETHGlobal, where I built and deployed decentralized applications. Through my professional experience, I’ve gained a solid understanding of classical backend development, as well as frontend technologies like React, Tailwind, and server actions. I bring a well-rounded technical skill set and adaptability across modern development stacks.",
    "website": "https://github.com/ppezzull",
    "email": "pezzullopietro04@gmail.com",
    "phone": "+393201407882",
    "location": {
      "city": "Rome",
      "countryCode": "IT"
    },
    "profiles": [
      {
        "network": "github",
        "username": "ppezzull",
        "url": "https://github.com/ppezzull"
      },
      {
        "network": "x",
        "username": "ppezz_eth",
        "url": "https://x.com/ppezz_eth"
      },
      {
        "network": "linkedin",
        "username": "pietro-jairo-pezzullo-764947237",
        "url": "https://linkedin.com/in/pietro-jairo-pezzullo-764947237"
      }
    ]
  },
  "education": [
    {
      "startDate": "2023-01-01",
      "endDate": "2025-08-01",
      "area": "Computer Science",
      "studyType": "Common Core Certification",
      "institution": "42 Roma Luiss",
      "gpa": "100",
      "location": "Rome, Italy",
      "summary": "Software development in UNIX/LINUX, GitHub and Co-Working, Scripting in bash, C, C++, Docker, Threads, Data structures and algorithms, OOP, Networking basics, HTTP protocol, VM's, Fullstack development"
    },
    {
      "startDate": "2020-10-01",
      "endDate": "2024-06-01",
      "area": "Corporate Information Systems",
      "studyType": "Technical Diploma",
      "institution": "IIS Leopoldo Pirelli via Assisi",
      "gpa": "78",
      "location": "Rome, Italy",
      "summary": "Law, Political Economy, Business Economics, English, Computer Science, History, Italian"
    }
  ],
  "references": [
    {
      "reference": "Available on request.",
      "name": "References"
    }
  ],
  "skills": [
    {
      "name": "Languages & Tools",
      "level": "Intermediate",
      "keywords": ["C", "Database", "Ethereum", "Linux", "Next.js", "Python", "React.js", "REST APIs", "TypeScript", "Web3"]
    }
  ],
  "awards": [
    {
      "title": "Defender of the Internet",
      "awarder": "Fight For The Future"
    }
  ],
  "work": [
    {
      "name": "Origins Solution",
      "location": "Rome, Italy",
      "position": "Fullstack Developer • Internship",
      "startDate": "2024-11-01",
      "endDate": "2025-06-30",
      "summary": "As a Junior Fullstack Developer at Origin Solutions, I have worked on both internal tools and client-commissioned applications, contributing across the entire development stack. My role involves building and maintaining frontend interfaces and backend services, ensuring seamless integration, performance, and usability in real-world environments.",
      "highlights": [
        "Developed and maintained fullstack applications using modern frameworks and tools.",
        "Collaborated on both internal products and external client solutions, adapting to diverse requirements and use cases.",
        "Built and improved backend APIs while integrating them with responsive, user-facing frontend components.",
        "Contributed to code reviews, bug fixes, and performance optimizations across the stack.",
        "Participated in the planning and execution of feature implementations in production-ready environments."
      ]
    },
    {
      "summary": "Tokenized is a Bitcoin wallet for issuing, managing and trading digital tokens. I built out the front end which was packaged as an electron app. It was a difficult frontend to build because we store the users keys locally and used them to sign transactions and contracts.",
      "website": "https://tokenized.com/",
      "name": "Tokenized",
      "location": "Melbourne",
      "position": "Senior Javascript Developer",
      "startDate": "2020-05-05",
      "highlights": ["React", "Redux", "SCSS", "Product"]
    },
    {
      "summary": "Blockbid is an Australian crypto currency exchange. I started off on the frontend but eventually became lead tech and worked on every moving piece of the exchange. I really enjoyed working with liquidity providers and connecting their platforms to help us achieve liquid markets.",
      "website": "https://platform.blockbid.io",
      "name": "Blockbid",
      "location": "Melbourne",
      "position": "Senior Javascript Developer",
      "startDate": "2018-03-01",
      "endDate": "2020-01-01",
      "highlights": [
        "React, Apollo, Styled Components",
        "Node.js / Rails",
        "Docker / Heroku / GCP",
        "Used Figma for design and UX work",
        "Optimizing markets with tens of millions of rows using SQL."
      ]
    },
    {
      "highlights": [
        "Worked with Postgres, Redis and Dynamodb for storage.",
        "Hosted on a mixture of Heroku Apps and EC2 servers.",
        "Caching by Fastly and Cloudflare",
        "Hybrid app supported on all platforms"
      ],
      "summary": "Built a very large and complex React / Redux application. It works on all platforms and has IOS/Android builds due to it being a PWA. (wrapped it in React Native though only implementing a WebView)",
      "website": "https://listium.com",
      "pinned": true,
      "name": "Listium",
      "position": "Developer",
      "startDate": "2016-01-01",
      "endDate": "2018-01-01"
    },
    {
      "highlights": [
        "Millions of sites use the CDN in production",
        "Larger market share than Yahoo's, Microsoft's and Google's javascript content distribution networks",
        "We serve hundreds of billions request a month",
        "Contains over 3000 popular Javascript libraries",
        "Millions of developers visit the site per year"
      ],
      "pinned": true,
      "summary": "Following Google's CDN for jQuery, we decided to start a CDN for the less popular Javascript frameworks. The CDN is community moderated and open source on GitHub. We secured a partnership with Cloudflare who now supports the infrastructure.",
      "website": "http://www.cdnjs.com",
      "name": "Cdnjs",
      "position": "Co-Founder",
      "startDate": "2011-01-08"
    },
    {
      "highlights": [
        "Developed new tools for contacting congress",
        "Brainstormed campaign ideas to raise maximum awareness about issues",
        "Lots of social networking integration"
      ],
      "summary": "Hired to take EFF's campaigning to the next level by building an action centre in Ruby on Rails. The action centre is built around some large open source tools that lower the barrier to entry when contacting congress.",
      "website": "http://www.eff.org",
      "name": "Electronic Frontier Foundation",
      "position": "Developer",
      "startDate": "2014-04-01",
      "endDate": "2016-01-01"
    },
    {
      "highlights": [
        "Managed a small team of developers and designers",
        "Built the entire frontend application with Backbone.js",
        "Transferred all of the infrastructure from Heroku to AWS"
      ],
      "summary": "Started off as a front end developer but took on the role of CTO in early 2013. The application frontend is built with Javascript and organized as a single page application that talks to a collection of Rails web servers which are connected to MongoDB.",
      "website": "http://www.earbits.com",
      "name": "Earbits",
      "position": "CTO",
      "endDate": "2015-01-09",
      "startDate": "2013-03-08"
    },
    {
      "highlights": ["This resume is built with JSON Resume", "Over 3000 stars on Github", "Community developed themes", "Tens of thousands of users"],
      "summary": "JSON Resume is a community driven open source initiative to create a JSON based standard for resumes. There is no reason why there can't be a common standard for writing a resume that can be extended with an ecosystem of open source tools.",
      "website": "http://jsonresume.org",
      "pinned": true,
      "name": "JSON Resume",
      "position": "Founder",
      "startDate": "2014-04-01"
    },
    {
      "highlights": [
        "Generated  37,000,000 banner views",
        "100, 000 phone calls to congress",
        "500, 000 emails",
        "250, 000 signatures"
      ],
      "summary": "Worked on many politically charged campaigns against mass surveillance. Not only technically challenging work but also a lot of networking and getting my hands dirty with politics.    Our biggest project was \"TheDayWeFightBack\"..",
      "website": "http://www.taskforce.is",
      "name": "Taskforce.is",
      "position": "Developer",
      "startDate": "2013-06-01",
      "endDate": "2016-01-01"
    },
    {
      "highlights": [
        "The site and blog combined have managed to receive over 200,000 visitors in 2014."
      ],
      "summary": "An international directory of civilian drone / UAV operators for hire. Services include aerial photography, aerial video, mapping, surveying, precision agriculture, real estate photography, remote inspections and infrared imaging. Our plan is to be the place to go when looking for UAV/Drone services. The website is built in Backbone.js and API is built with Node.js and Postgres. ",
      "website": "http://www.dronehire.org",
      "name": "Drone Hire",
      "position": "Co-Founder",
      "startDate": "2013-01-01"
    },
    {
      "highlights": [
        "Over two million unique visitors a year",
        "25,000+ ebook downloads",
        "300,000+ Youtube views"
      ],
      "summary": "I write tutorials and blog post regarding the popular Javascript framework Backbone.js. The tutorials cover a range of topics regarding front end development aimed at beginners, experts and anyone in between.",
      "website": "http://backbonetutorials.com",
      "name": "BackboneTutorials.com",
      "position": "Founder",
      "startDate": "2011-01-01",
      "endDate": "2014-01-01"
    },
    {
      "summary": "Ephox is a worldwide company who is heavily involved with the development of TinyMce and enterprise editors. My primary role included building front-end widgets and applications. Worked on a major product using Backbone.js as a base. Heavily involved in UI/UX design and wire-framing. Also spend a lot of time designing API specifications and documentation.",
      "website": "http://ephox.com",
      "name": "Ephox",
      "position": "Front-end Developer",
      "endDate": "2012-06-01",
      "startDate": "2011-01-01"
    }
  ],
  "projects": [
    {
      "name": "Urbe Campus Hackathon Winner Project",
      "startDate": "2024-02-01",
      "endDate": "2024-02-29",
      "summary": "Led backend development for 42Care, a decentralized fundraising app. Collaborated with a cross-functional team to connect the backend and frontend in Next.js. Put Web3 skills to the test and won the hackathon.",
      "highlights": ["Fullstack Web3 development", "Smart contract integration", "Next.js frontend integration"]
    }
  ],
  "certifications": [
    {
      "title": "TOEFL (Test of English as a Foreign Language)",
      "date": "2025-01-01",
      "awarder": "ETS"
    },
    {
      "title": "PCAP - Certified Associate in Python Programming",
      "date": "2022-06-01",
      "awarder": "Python Institute"
    }
  ],
  "publications": [
    {
      "name": "OnlyFive Quiz Game",
      "summary": "A quiz editor and games aimed to advertise companies.",
      "url": "http://www.onlyfive.it"
    }
  ],
  "interests": [
    {
      "name": "Gardening"
    },
    {
      "name": "Music / Jamming"
    },
    {
      "name": "Reading / Writing"
    },
    {
      "name": "Open Source"
    }
  ]
}
